---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidTemperature
source: html/e84eb32b-5a1e-acf3-e765-d484d2d6eee4.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidTemperature Property

Fluid Temperature, in Kelvin.

## Syntax (C#)
```csharp
public double FluidTemperature { get; set; }
```